// pages/about/about.js
Page({

  /**
   * 页面的初始数据
   */
  data: {
    introduction:'瓜大易行开发团队是一个由软件学院2019级9位热爱软件开发技术，致力于服务同学学生组成的小型开发团队。其代表作有“瓜大易行”微信小程序。使用过程中若有疑问或发现bug请与我们联系！'
  },

  /**
   * 生命周期函数--监听页面加载
   */
  onLoad(options) {

  },

  /**
   * 生命周期函数--监听页面初次渲染完成
   */
  onReady() {

  },

  /**
   * 生命周期函数--监听页面显示
   */
  onShow() {

  },

  /**
   * 生命周期函数--监听页面隐藏
   */
  onHide() {

  },

  /**
   * 生命周期函数--监听页面卸载
   */
  onUnload() {

  },

  /**
   * 页面相关事件处理函数--监听用户下拉动作
   */
  onPullDownRefresh() {

  },

  /**
   * 页面上拉触底事件的处理函数
   */
  onReachBottom() {

  },

  /**
   * 用户点击右上角分享
   */
  onShareAppMessage() {

  }
})